// '开发时间': {
//   '2018年下': { },
//   '2018年上': { },
//   '2017年下': { },
//   '2017年上': { },
//   '2017年前': { }
// },
// '适用季节': {
//   '春': { },
//   '夏': { },
//   '秋': { },
//   '冬': { }
// },
// '图案': {
//   '人': { },
//   '动物': { },
//   '植物': { },
//   '圆点': { },
//   '条纹': { },
//   '格子': { },
//   '净色特种': { },
//   '素色': { },
//   '其它': { }
// },
// '适用品类': {
//   'T恤/打底衫': { },
//   '大衣': { },
//   '外套': { },
//   '衬衫': { },
//   '裤子': { },
//   '家居服': { },
//   '婴儿服装(哈衣/爬服)': { },
//   '棉衣/羽绒服/户外服': { },
//   '泳装': { },
//   '校服': { },
//   '其它': { }
// },
// '织法': {
//   '梭织': {
//     '平纹': { },
//     '斜纹': { },
//     '缎纹': { },
//     '其它梭织': { },
//   },
//   '针织': {
//     '罗纹布': { },
//     '大卫衣': { },
//     '小卫衣': { },
//     '坑条': { },
//     '珠地': { },
//     '蕾丝': { },
//     '毛圈布': { },
//     '网布': { },
//     '摇粒绒': { },
//     '毛巾布': { },
//     '针织平纹': { },
//     '针织斜纹': { },
//     '汗布': { },
//     '针织缎纹': { },
//     '起绒/毛布': { },
//     '网眼布': { },
//     '其它针织': { }
//   },
//   '无纺布': {
//     '皮革': { },
//     '水刺无纺': { },
//     '针织无纺': { },
//     '纺粘无纺': { },
//     '熔喷无纺': { },
//     '热轧无纺': { },
//     '其他无纺': { }
//   }
// },
// '材质': {
//   '棉类': {
//     '纱卡': { },
//     '平布': { },
//     '斜纹布': { },
//     '府绸': { },
//     '全棉布': { },
//     '净色棉': { },
//     '牛仔布': { },
//     '灯芯绒': { },
//     '帆布': { },
//     '缎纹/贡缎': { },
//     '棉竹节': { },
//     '其它(棉)': { }
//   },
//   '麻类': {
//     '大麻': { },
//     '黄麻': { },
//     '剑麻': { },
//     '亚麻': { },
//     '苎麻': { },
//     '麻混纺': { },
//     '其它(麻)': { }
//   },
//   '化纤': {
//     '粘胶': { },
//     '人造棉': { },
//     '人造丝': { },
//     '空气层': { },
//     '氨纶': { },
//     '腈纶': { },
//     '其它(化纤)': { }
//   },
//   '混纺': {
//     '棉毛混纺': { },
//     '化纤类混纺': { },
//     '交织类混纺': { },
//     'T/C': { },
//     'T/R': { },
//     'T/A': { },
//     '锦棉': { },
//     'N/C': { },
//     'CVC': { },
//     '其它(混纺)': { }
//   },
//   '皮毛': {
//     '毛毡': { },
//     '毛呢/呢绒': { },
//     '金毛': { },
//     '呢绒': { },
//     '鹿皮绒': { },
//     '人造皮革': { },
//     '羊毛': { },
//     '羊绒': { },
//     '法兰绒': { },
//     '麦呢': { },
//     '其它(皮毛)': { }
//   },
//   '新型纤维': {
//     '天丝': { },
//     '莫代尔': { },
//     '铜氨丝': { },
//     '粘纤': { },
//     '醋酸纤维': { },
//   },
//   '真丝/仿真丝': {
//     '绢': { },
//     '乔琪': { },
//     '锦': { },
//     '缎': { },
//     '绉': { },
//     '罗': { },
//     '绸': { },
//     '绫': { },
//     '其它(丝)': { }
//   }
// },
// '所在市场': {
//   '广州': { },
//   '柯桥': { },
//   '盛泽': { },
//   '石狮': { },
//   '织里': { }
// },
// '货期': {
//   '现货': { },
//   '1-3天': { },
//   '3-7天': { },
//   '7-14天': { },
//   '14天以上': { }
// },
// '弹性': {
//   '单向': { },
//   '四面': { },
//   '无': { }
// }

export default [{
    "name": "开发时间",
    "sub": [{
        "name": "2018年下",
        "sub": [{
          "name": "暂无"
        }]
      },
      {
        "name": "2018年上"
      },
      {
        "name": "2017年下"
      },
      {
        "name": "2017年上"
      },
      {
        "name": "2017年前"
      },
    ]
  },
  {
    "name": "适用季节",
    "sub": [{
        "name": "春",
      },
      {
        "name": "夏",
      },
      {
        "name": "秋",
      },
      {
        "name": "冬",
      },
    ]
  },
  {
    "name": "图案",
    "sub": [{
        "name": "人"
      },
      {
        "name": "动物"
      },
      {
        "name": "植物"
      },
      {
        "name": "圆点"
      },
      {
        "name": "条纹"
      },
      {
        "name": "格子"
      },
      {
        "name": "净色特种"
      },
      {
        "name": "素色"
      },
      {
        "name": "其他"
      }
    ]
  },
  {
    "name": "适用品类",
    "sub": [{
        "name": "T恤/打底衫"
      },
      {
        "name": "大衣"
      },
      {
        "name": "外套"
      },
      {
        "name": "衬衫"
      },
      {
        "name": "裤子"
      },
      {
        "name": "家居服"
      },
      {
        "name": "婴儿服装(哈衣/爬服)"
      },
      {
        "name": "棉衣/羽绒服/户外服"
      },
      {
        "name": "泳装"
      },
      {
        "name": "校服"
      },
      {
        "name": "其它"
      }
    ]
  },
  {
    "name": "织法",
    "sub": [{
        "name": "梭织",
        "sub": [{
          "name": "平纹"
        }, {
          "name": "斜纹"
        }, {
          "name": "缎纹"
        }, {
          "name": "其他梭织"
        }]
      },
      {
        "name": "针织",
        "sub": [{
          "name": "罗纹布"
        }, {
          "name": "大卫衣"
        }, {
          "name": "小卫衣"
        }, {
          "name": "坑条"
        }, {
          "name": "珠地"
        }, {
          "name": "蕾丝"
        }, {
          "name": "毛圈布"
        }, {
          "name": "网布"
        }, {
          "name": "摇粒绒"
        }, {
          "name": "毛巾布"
        }, {
          "name": "针织平纹"
        }, {
          "name": "针织斜纹"
        }, {
          "name": "汗布"
        }, {
          "name": "针织缎纹"
        }, {
          "name": "起绒/毛布"
        }, {
          "name": "网眼布"
        }, {
          "name": "其它针织"
        }, ]
      },
      {
        "name": "无纺布",
        "sub": [{
            "name": "皮革"
          }, {
            "name": "水刺无纺"
          }, {
            "name": "针织无纺"
          }, {
            "name": "纺粘无纺"
          }, {
            "name": "熔喷无纺"
          }, {
            "name": "热轧无纺"
          },
          {
            "name": "其他无纺"
          },
        ]
      }
    ]
  },
  {
    "name": "材质",
    "sub": [{
      "name": "棉类",
      "sub": [{
        "name": "纱卡"
      }, {
        "name": "平布"
      }, {
        "name": "斜纹布"
      }, {
        "name": "府绸"
      }, {
        "name": "全棉布"
      }, {
        "name": "净色棉"
      }, {
        "name": "牛仔布"
      }, {
        "name": "灯芯绒"
      }, {
        "name": "帆布"
      }, {
        "name": "缎纹/贡缎"
      }, {
        "name": "棉竹节"
      }, {
        "name": "其它(棉)"
      }]
    }, {
      "name": "麻类",
      "sub": [{
        "name": "大麻"
      }, {
        "name": "黄麻"
      }, {
        "name": "剑麻"
      }, {
        "name": "亚麻"
      }, {
        "name": "苎麻"
      }, {
        "name": "麻混纺"
      }, {
        "name": "其它(麻)"
      }]
    }, {
      "name": "化纤",
      "sub": [{
        "name": "粘胶"
      }, {
        "name": "人造棉"
      }, {
        "name": "人造丝"
      }, {
        "name": "空气层"
      }, {
        "name": "氨纶"
      }, {
        "name": "腈纶"
      }, {
        "name": "其它(化纤)"
      }]
    }, {
      "name": "混纺",
      "sub": [{
        "name": "棉毛混纺"
      }, {
        "name": "化纤类混纺"
      }, {
        "name": "交织类混纺"
      }, {
        "name": "T/C"
      }, {
        "name": "T/R"
      }, {
        "name": "T/A"
      }, {
        "name": "锦棉"
      }, {
        "name": "N/C"
      }, {
        "name": "CVC"
      }, {
        "name": "其它(混纺)"
      }]
    }, {
      "name": "皮毛",
      "sub": [{
        "name": "毛毡"
      }, {
        "name": "毛呢/呢绒"
      }, {
        "name": "金毛"
      }, {
        "name": "呢绒"
      }, {
        "name": "鹿皮绒"
      }, {
        "name": "人造皮革"
      }, {
        "name": "羊毛"
      }, {
        "name": "羊绒"
      }, {
        "name": "法兰绒"
      }, {
        "name": "麦呢"
      }, {
        "name": "其它(皮毛)"
      }, ]
    }, {
      "name": "新型纤维",
      "sub": [{
        "name": "天丝"
      }, {
          "name": "莫代尔"
        }, {
          "name": "铜氨丝"
        }, {
          "name": "粘纤"
        }, {
          "name": "醋酸纤维"
        }
      ]
    }, {
      "name": "真丝/仿真丝",
      "sub": [{
        "name": "绢"
      }, {
          "name": "乔琪"
        }, {
          "name": "锦"
        }, {
          "name": "缎"
        }, {
          "name": "绉"
        }, {
          "name": "罗"
        }, {
          "name": "绸"
        }, {
          "name": "绫"
        }, {
          "name": "其它(丝)"
        },
      ]
    }]
  },
  {
    "name": "所在市场",
    "sub": [{
      "name": "广州"
    }, {
        "name": "广州"
      }, {
        "name": "柯桥"
      }, {
        "name": "盛泽"
      }, {
        "name": "石狮"
      }, {
        "name": "织里"
      },
    ]
  },
  {
    "name": "货期",
    "sub": [{
      "name": "现货"
    }, {
      "name": "1-3天"
    }, {
      "name": "3-7天"
    }, {
      "name": "7-14天"
    }, {
      "name": "14天以上"
    }
    ]
  },
  {
    "name": "弹性",
    "sub": [{
      "name": "单向"
    }, {
      "name": "四面"
    }, {
      "name": "无"
    }
    ]
  }
]